Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Check whether this string contains only uppercase characters.
fr: Vérifie si cette chaîne ne contient que des caractères majuscules.

source: Checks if a string contains only hexadecimal digit (0-9, A-F) characters.
fr: Vérifie si une chaîne contient uniquement des caractères hexadécimaux (0-9, A-F).

source: 0 if string contains non-hexadecimal characters.
fr: Retourne 0 si la chaîne contient des caractères non-hexadécimaux.

source: Valid characters are 0123456789abcdefABCDEF Note that a string containing whitespace or the "0x" prefix will cause StringIsXDigit() to return 0.
fr: Les caractères valides sont 0123456789abcdefABCDEF.Notez qu'une chaîne contenant des espaces blancs ou le préfixe "0x" fera que StringIsXDigit() retournera 0 comme valeur de retour.

source: Returns 1, as the string contains only hexadecimal (0-9, A-F) characters.
fr: Retourne 1, car la chaîne ne contient que des chiffres hexadécimaux (0-9, AF) caractères.

source: Returns 0, due to the string containing whitespace.
fr: Retourne 0, car la chaîne de caractères contenant des espaces.

source: Returns a number of characters from the left-hand side of a string.
fr: Retourne un nombre de caractères à partir de la gauche d'une chaîne.

source: The number of characters to get.
fr: Le nombre de caractères à extraire.

source: Returns a string containing the leftmost count characters of the string.
fr: Retourne une chaîne contenant le nombre souhaité de caractères les plus à gauche de la chaîne.

source: If count exceeds string length, the entire string is returned.
fr: Si count excède la longueur de chaîne, la chaîne entière est retournée.

source: If count is negative, an empty string is returned.
fr: Si count est négatif, une chaîne vide est retournée.

source: Retrieve 5 characters from the left of the string.
fr: Récupére 5 caractères à la gauche de la chaîne.

source: Returns the number of characters in a string.
fr: Retourne le nombre de caractères d'une chaîne.

source: Returns the length of the string.
fr: Retourne la longueur de la chaîne.

source: A numeric expression is automatically evaluated and converted to a string.
fr: Une expression numérique est d'abord évaluée puis le résultat est convertie en chaîne.

source: Retrieve the length of a string.
fr: Récupére la longueur d'une chaîne.

source: If the string is using only ASCII characters, then the length is equal to the size in bytes e.g.10 characters is 10 bytes.
fr: Si la chaîne utilise uniquement des caractères ASCII, la longueur est égale à la taille en octets par exemple 10 caractères égale 10 octets.

source: Converts a string to lowercase.
fr: Convertit une chaîne en minuscules.

source: Returns the string converted to lowercase.
fr: Retourne la chaîne convertie en minuscules.

source: Convert the following string to lowercase.
fr: Convertit la chaîne suivante en minuscules.

source: Extracts a number of characters from a string.
fr: Extrait un nombre donné de caractères d'une chaîne.

source: The character position to start.
fr: La position du caractère de départ.

source: (1 = first character)
fr: (1 = premier caractère)

source: The number of characters to extract.
fr: Le nombre de caractères à extraire.

source: By default the entire remainder of the string.
fr: Par défaut tout le reste de la chaîne.

source: Returns the extracted string.
fr: Retourne la chaîne extraite.

source: If start is out-of-bounds, an empty string is returned.
fr: Si start est hors limites, une chaîne vide est retournée.

source: If start is valid but count is out-of-bounds, the entire remainder of the string is returned.
fr: Si start est valide, mais count hors limites, le reste de la chaîne est renvoyée.

source: Retrieve 5 characters from the 10th position in the string.
fr: Récupére 5 caractères à partir de la 10e position dans la chaîne.

source: Check if a string fits a given regular expression pattern.
fr: Vérifie si une chaîne de caractères correspond à un modèle d'expression régulière.

source: The subject string to check
fr: La chaîne à vérifier

source: The regular expression to match.
fr: L'expression régulière à utiliser.

source: A number to indicate how the function behaves.
fr: Valeur qui conditionne le comportement de la fonction.

source: See below for details.
fr: Voir plus bas pour plus de détails.

source: The string position to start the match (starts at 1).
fr: La position dans la chaîne du début de la recherche (commence à 1).

source: Returns 1 (match) or 0 (no match).(Default).
fr: Retourne 1 (correspondance trouvée) ou 0 (aucune correspondance trouvée)

source: Return array of matches.
fr: Retourne le tableau des occurrences.

source: Return array of matches including the full match (Perl / PHP style).
fr: Retourne un tableau de résultats incluant le résultat complet (style Perl / PHP).

source: Return array of global matches.
fr: Retourne un tableau de résultats globaux.

source: Return an array of arrays containing global matches including the full match (Perl / PHP style).
fr: Retourne un tableau de tableaux contenant les résultats globaux incluant le résultat complet (style Perl / PHP).

source: Flag = $STR_REGEXPMATCH (0) :
fr: Mode = $STR_REGEXPMATCH (0) :

source: 2 Bad pattern.
fr: 2 Modèle erroné.

source: @extended = offset of error in pattern.
fr: @Extended = position de l'erreur dans le modèle.

source: Flag = $STR_REGEXPARRAYMATCH (1) or $STR_REGEXPARRAYFULLMATCH (2) :
fr: Mode = $STR_REGEXPARRAYMATCH (1) ou $STR_REGEXPARRAYFULLMATCH (2) :

source: 0 Array is valid.
fr: 0 Tableau valide.

source: Check @extended for next offset
fr: @extended = position suivante dans le sujet

source: 1 Array is invalid.No matches.
fr: 1 Tableau invalide : aucune correspondance.

source: 2 Bad pattern, array is invalid.
fr: 2 Modèle erroné : tableau invalide.

source: Flag = $STR_REGEXPARRAYGLOBALMATCH (3) or $STR_REGEXPARRAYGLOBALFULLMATCH (4) :
fr: Mode = $STR_REGEXPARRAYGLOBALMATCH (3) ou $STR_REGEXPARRAYGLOBALFULLMATCH (4) :

source: The flag parameter can have one of 5 values ($STR_REGEXPMATCH (0) through $STR_REGEXPARRAYGLOBALFULLMATCH (4)).
fr: Le paramètre flag peut avoir une des 5 valeurs ($STR_REGEXPMATCH (0) à $STR_REGEXPARRAYGLOBALFULLMATCH (4)).

source: returns 1 (true) or 0 (false) if the pattern was found or not.
fr: retourne 1 (True) ou 0 (False) selon que le modèle a été trouvé ou pas.

source: find the first match and return captured groups in an array; when the pattern has no capturing groups, the first match is returned in the array.
fr: trouve la première correspondance et retourne les groupes capturés dans un tableau ; quand le modèle n'a pas capturé de groupe, la première correspondance est retournée dans le tableau.

source: fill the array with all matching instances.
fr: remplit le tableau avec toutes les occurrences des correspondances.

source: $STR_REGEXPARRAYFULLMATCH (2) and $STR_REGEXPARRAYGLOBALFULLMATCH (4) include the full matching text as the first element of the return array, not just the captured groups as with flag $STR_REGEXPARRAYMATCH (1) and $STR_REGEXPARRAYGLOBALMATCH (3).
fr: $STR_REGEXPARRAYFULLMATCH (2) et $STR_REGEXPARRAYGLOBALFULLMATCH (4) incluent le texte complet de la correspondance comme le premier élément du tableau retourné, pas seulement les groupes capturés comme avec les flags $STR_REGEXPARRAYMATCH (1) et $STR_REGEXPARRAYGLOBALMATCH (3).

source: Regular expression notation is a compact way of specifying a pattern for subject strings that can be searched and from which specific parts can be extracted by StringRegExp() or replaced when using StringRegExpReplace().
fr: La notation d'expression régulière est une façon compacte de définir un modèle de chaîne à rechercher et à partir duquel des portions spécifiques peuvent être extraites avec StringRegExp() ou remplacées par StringRegExpReplace().

source: More precisely, the regular expression engine tries to match a pattern (a kind of programmatic format) with a subject string, both from left to right.
fr: Plus précisément, le moteur des expressions régulières s'efforce de trouver une ou des correspondances entre le modèle (une sorte de format préprogrammé) et la chaîne sujet, de la gauche vers la droite.

source: Should a mismatch occur, the engines tries to backtrack (return to successively previous states) as much as needed, expecting that the rest of the pattern will match as well.
fr: Si une différence apparaît, le moteur tente de faire marche arrière (retour à des états précédents successifs) autant que nécessaire, espérant que le reste du modèle correspondra ainsi.

source: Backtracking is a fundamental feature of regular expression engines and one that every novice programmer already understand and uses daily.
fr: Le retour arrière ('backtracking') est un aspect fondamental des moteurs d'expressions régulères et même le programmeur novice utilise ce mécanisme tous les jours.

source: It is like leaving a specific mark on every fork in the road and going back to the last untried path when the choosen path turns out to be a dead end: you backtrack as needed until you find the right point (match success) or explore every path without reaching your goal (match failure).Searching a given filename with optional wildcards inside a directory tree is no different.
fr: Il consiste à laisser une marque spécifique à chaque embranchement du chemin qu'on parcourt et de revenir à l'embranchement précédent pour explorer l'autre voie lorsque le chemin choisi se révèle être une impasse : vous faites marche arrière (backtrack) au besoin jusqu'à trouver le but du parcours (correspondance trouvée) ou avoir exploré toutes les voies sans atteindre l'objectif (correspondance non trouvée).Ce principe d'exploration est utilisé lors de la recherche d'un nom de fichier donné avec jokers facultatifs à l'intérieur d'une arborescence de répertoires.

source: AutoIt uses the PCRE engine.
fr: AutoIt utilise le moteur PCRE.

source: PCRE means "Perl-Compatible Regular Expressions" and is the most comprehensive open-source engine available.
fr: PCRE signifie "Perl-Compatible Regular Expressions" et c'est le plus complet des moteurs open-source disponibles.

source: This implementation includes Unicode Category Properties (UCP) support, which allows fine-grain processing of most human languages.
fr: Cette implémentation inclut le support Unicode Category Properties (UCP), qui permet un traitement fin de la plupart des langages humains.

source: However to maintain compatibility with previous versions and keep matching speed at its best, the UCP support is not enabled by default.
fr: Cependant, pour maintenir la compatibilité avec les versions précédentes et optimiser la vitesse d'exécution, le support UCP n'est pas activé par défaut.

source: You can enable it by prepending the string (*UCP) at the very start of your pattern.
fr: Vous pouvez l'activer en faisant insérant la chaîne (*UCP) en tête du modèle.

source: When enabled, the UCP setting changes the extend of a number of regular expression elements, as documented below where applicable.
fr: Lorsqu'il est activé, le réglage UCP change l'étendue d'un certain nombre d'éléments d'expressions régulières, comme documenté ci-dessous, le cas échéant.

source: This page is only a summary for the most used pattern elements.
fr: Cette page est un résumé des éléments de modèle les plus utilisés.

source: For full in-depth discussion of regular expressions as implemented in AutoIt, refer to the complete description of PCRE patterns.
fr: Pour une documentation complète et approfondie des expressions régulières implémentées dans AutoIt, reportez-vous à la description complète des modèles PCRE.

source: Unless you are already familiar with regular expressions you will probably need to read several parts of this summary more than once to grasp how they work and inter-relate.
fr: Sauf si vous êtes déjà familier avec les expressions régulières, vous aurez probablement besoin de lire plusieurs parties de ce résumé plus d'une fois pour comprendre comment elles fonctionnent et sont reliées entre elles.

source: Caution: bad regular expressions can produce a quasi-infinite loop hogging the CPU, and can even cause a crash.
fr: Attention : des expressions régulières mal conçues peuvent entraîner une boucle quasi-infinie mobilisant le processeur, entraînant même un dépassement de la pile utilisable.

source: Global settings
fr: Paramètres globaux

source: These settings are only recognized at the start of the pattern and affect it globally.
fr: Ces paramètres ne sont pris en compte qu'au début du modèle et l'affectent globalement.

source: Newline conventions
fr: Conventions de retour à la ligne

source: Newline sequences affect where the ^ and $ anchors match and what \N and .
fr: Les séquences de saut de ligne affectent la sémantique des ancrages ^ et $, ainsi que des éléments \N et .

source: By default the newline sequence is @CRLF as an unbreakable sequence or lone @CR or @LF.
fr: Par défaut, les séquences de saut de ligne reconnues sont soit @CRLF, soit @CR ou @LF isolés.

source: The default can be changed by prepending one of the following sequence at the start of a pattern.
fr: La valeur par défaut peut être modifiée en ajoutant l'une des séquences suivantes au début d'un modèle :

source: Carriage return immediately followed by linefeed (@CRLF).
fr: Carriage return immédiatement suivi de linefeed (@CRLF).

source: Any of @CRLF, @CR or @LF.
fr: Toute séquence @CRLF, @CR ou @LF.

source: This is the default newline convention.
fr: Ceci est la convention de saut de ligne par défaut.

source: Any Unicode newline sequence:
fr: Une des séquences de saut de ligne Unicode :

source: @CRLF, @LF, VT, FF, @CR or \x85.
fr: @CRLF, @LF, VT, FF, @CR ou \x85.

source: What \R matches
fr: Signification de \R

source: By default \R matches @CRLF, @CR or @LF only.
fr: Par défaut \R correspond à @CRLF, @CR ou @LF.

source: Changes \R to match any Unicode newline sequence:
fr: Change la signification de \R pour correspondre à toute séquence de saut de ligne Unicode :

source: PCRE patterns may contain options, which are enclosed in (?
fr: Les modèles PCRE peuvent contenir des options, qui sont entourées par des séquences (?

source: Options can be grouped together:
fr: Les options peuvent être regroupés :

source: Options following an hyphen are negated:
fr: Les options suivant un tiret sont annulées :

source: Options appearing outside a group affect the remaining of the pattern from that point onwards.
fr: Les options apparaissant en dehors d'un groupe affectent la suite du modèle.

source: Options appearing inside a group affect that group only.Options loose their special meaning inside a character class, where they are treated literally.
fr: Les options apparaissant à l'intérieur d'un groupe influent sur ce groupe seulement et à partir de leur point d'apparition.Les options perdent leur signification spéciale à l'intérieur d'une classe de caractères, où elles sont traitées littéralement.

source: Caseless: matching becomes case-insensitive from that point on.
fr: Insensibilité à la casse : la correspondance devient insensible à la casse à partir de ce point.

source: By default, matching is case-sensitive.
fr: Par défaut, la correspondance est sensible à la casse.

source: When UCP is enabled casing applies to the entire Unicode plane 0, else applies by default to ASCII letters A-Z and a-z only.
fr: Quand l'option UCP est activée elle s'applique à l'ensemble du plan Unicode 0, sinon elle s'applique par défaut seulement aux lettres ASCII A-Z et a-z.

source: Multiline:
fr: Multiligne :

source: ^ and $ match at newline sequences within data.
fr: ^ et $ correspondent soit au début (resp.à la fin) du sujet, soit à la position précédent (resp.

source: By default, multiline is off.
fr: suivant) une séquence de saut de ligne.Par défaut, l'option multiligne est désactivée.

source: Single-line or DotAll:
fr: Mono-ligne ou DotAll:

source: matches anything including a newline sequence.
fr: correspond à tout caractère, y compris une séquence de saut de ligne.

source: By default, DotAll is off hence .
fr: L'option DotAll est désactivée par défaut, ainsi .

source: does not match a newline sequence.
fr: ne correspond pas à une séquence de saut de ligne.

source: Ungreedy: quantifiers become lazy (non-greedy) from that point on.
fr: Paresseux : les quantificateurs deviennent paresseux (non gourmands) à partir de ce point.

source: By default, matching is greedy - see below for further explanation.
fr: Par défaut, la recherche est gourmande - voir ci-dessous pour plus de détails.

source: eXtended: whitespaces outside character classes are ignored and # starts a comment up to the next solid newline in pattern.
fr: Étendu : les espaces blancs à l'extérieur des classes de caractères sont ignorés et # démarre un commentaire jusqu'à la prochaine nouvelle ligne dans le modèle.

source: Meaningless whitespaces between components make regular expressions much more readable.
fr: L'espacement des éléments rendent les expressions régulières beaucoup plus lisibles.

source: By default, whitespaces match themselves and # is a literal character.
fr: Par défaut, les espaces blancs et # sont interprétés littéralement.

source: Characters, metacharacters and escaping (or quoting)
fr: Caractères, méta-caractères et echappement (escaping ou quoting)

source: Characters
fr: Caractères

source: Regular expressions patterns consist of literal Unicode text parts which match themselves, intermixed with regular expression specifiers or options.
fr: Les modèles d'expressions régulières se composent de littéraux Unicode (portions de texte qui correspondent à elles-mêmes), entremêlées d'éléments ou d'options d'expression régulière.

source: Specifiers and options use a few metacharacters which have a special meaning by themselves or introduce special pattern elements described in the tables below.
fr: Les éléments et les options utilisent quelques méta-caractères qui ont eux-même une signification particulière ou qui marquent le début d'éléments plus complexes décrits dans les tableaux ci-dessous.

source: In literal parts, alphanumeric characters always stand for themselves: the pattern "literal part with 中国文字" matches exactly the string "literal part with 中国文字" ("中国文字" means "chinese text".)
fr: Dans les portions littérales, les caractères alphanumériques correspondent eux-mêmes : le modèle "partie littérale avec 中国文字" correspond exactement à la chaîne "partie littérale avec 中国文字" ("中国文字" signifie "texte chinois".)

source: Some non-alphanumeric characters called metacharacters have special behavior, discussed thereafter.
fr: Certains caractères non-alphanumériques appelés métacaractères ont un comportement particulier, discuté par la suite.

source: Representing some characters literally
fr: Représentation de quelques caractères littéraux

source: The special sequences below are used to represent certain characters literally.
fr: Les séquences spéciales ci-dessous sont utilisés pour représenter certains caractères littéralement.

source: Represents "alarm", the BEL character (Chr(7)).
fr: Représente "alarm", le caractère BEL (Chr(7)).

source: Represents "control-X", where X is any 7-bit ASCII character.
fr: Représente "contrôle-X", où X représente tout caractère ASCII 7 bits.

# For example, "cM" represents ctrl-M, same as x0D or (Chr(13)).
source: For example, "\cM" represents ctrl-M, same as \x0D or \r (Chr(13)).
fr: Par exemple, "\cM" représente ctrl-M, aussi représentable par \x0D ou \r (Chr(13)).

source: Represents the "escape" control character (Chr(27)).
fr: Représente le caractère de contrôle "échappement" (Chr(27)).

source: Not to be confused with the escaping of a character!
fr: Ne pas confondre avec l'échappement (escaping) d'un caractère!

source: Represents "formfeed" (Chr(12)).
fr: Représente "formfeed" (Chr(12)).

source: Represents "linefeed" (@LF, Chr(10)).
fr: Représente "linefeed" (@LF, Chr(10)).

source: Represents "carriage return" (@CR, Chr(13)).
fr: Représente "carriage return" (@CR, Chr(13)).

source: Represents "tab" (@TAB, Chr(9)).
fr: Représente "tab" (@TAB, Chr(9)).

source: Represents character with octal code ddd, OR backreference to capturing group number ddd in decimal.
fr: Représente le caractère de code octal ddd, OU une référence arrière au groupe capturant numéro ddd (en décimal).

source: For example, ([a-z])\1 would match a doubled letter.
fr: Par exemple, ([a-z])\1 correspond à une minuscule doublée.

source: Best avoided as it can be ambiguous!
fr: À éviter soigneusement à cause de cette ambiguité !

source: Favor the hex representations below.
fr: Utiliser de préférence les représentations hexadécimales ci-dessous.

source: Represents Unicode character with hex codepoint hh:
fr: Représente un caractère Unicode en hexadécimal hh :

source: "\x7E" represents a tilde, "~".
fr: "\x7E" représente une tilde, "~".

source: Represents Unicode character with hex codepoint hhhh:
fr: Représente un caractère Unicode en héxadécimal hhhh :

source: "\x{20AC}" represents the Euro symbol, "€" (ChrW(0x20AC)).
fr: "\x{20AC}" représente le symbole de l'Euro, "€" (ChrW(0x20AC)).

source: where x is non-alphanumeric, stands for a literal x.
fr: où x est non-alphanumérique, représente un caractère x littéral.

source: Used to represent metacharacters literally:
fr: C'est l'échappement du caractère x.

source: "\.\[" represents a dot followed by a left square bracket, ".[".
fr: Utilisé pour représenter les méta-caractères littéraux :"\.\[" représente un point suivi d'un crochet ouvrant, ".[".

source: Verbatim sequence: metacharacters loose their special meaning between \Q and \E:
fr: Séquence verbatim : les méta-caractères perdent leur signification spéciale entre \Q et \E :

source: "\Q(.)\E" matches "(.)" and is equivalent to, but more readable than, "\(\.\)".
fr: "\Q(.)\E" recherche la chaîne "(.)" et est bien plus lisible que le modèle équivalent "\(\.\)" .

source: Metacharacters
fr: Méta-caractères

source: PCRE metacharacters are \ .
fr: Les méta-caractères PCRE sont \ .

source: # which have one or more special meaning, depending on context.
fr: # ils ont une ou plusieurs significations, selon le contexte.

source: To insert a literal metacharacter, preceede it by a backslash (this is called escaping (or quoting) a character):
fr: Pour insérer un méta-caractère littéral, faites-le précéder par une barre oblique inverse ('backslash') (c'est l'échappement de ce caractère) :

source: "\$" means the dollar character.
fr: "\$" signifie le caractère dollar.

source: Metacharacters will be discussed in separate sections where their behavior or meaning belong.
fr: Les méta-caractères seront abordés dans des sections distinctes qui traitent de leur comportement et de leur signification.

source: Character types
fr: Types de caractères

source: Matches any single character except, by default, a newline sequence.
fr: Correspond à tout caractère Unicode excepté une séquence de saut de ligne.

source: Matches newlines as well when option (?s) is active.
fr: Correspond à tout caractère Unicode lorsque l'option (?s) est active.

source: Matches any decimal digit (any Unicode decimal digit in any language when UCP is enabled).
fr: Correspond à tout chiffre décimal (n'importe quel chiffre décimal Unicode de n'importe quel langage quand UCP est activé).

source: Matches any non-digit.
fr: Correspond à tout caractère qui n'est pas un chiffre.

source: Matches any horizontal whitespace character (see table below).
fr: Correspond à tout caractère d'espacement horizontal (voir tableau ci-dessous).

source: Matches any character that is not a horizontal whitespace character.
fr: Correspond à tout caractère hors espacements horizontal.
